<a href="https://colab.research.google.com/github/19pa1a02a6/AI_lab/blob/master/Untitled3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## EXPERIMENT NO : 2 (PANDAS)

In [ ]:
import pandas as pd
import numpy as np

1) create a dataframe manually

In [ ]:
data = {'Roll No':['255','282', '2A6'], 'Name':['gayatri','abhinaya','hari priyanka']}
df = pd.DataFrame(data=data)
df

  Roll No           Name
0     255        gayatri
1     282       abhinaya
2     2A6  hari priyanka

2) import data into a dataframe

In [ ]:
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [ ]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [ ]:
df.shape

(117, 9)

In [ ]:
df.describe

<bound method NDFrame.describe of      Roll No Gender  ... registered_for_ Placement_Training  placement status
0          1      M  ...                                 NO        Not placed
1          2      F  ...                                yes            Placed
2          3      F  ...                                yes        Not placed
3          4      M  ...                                yes        Not placed
4          5      M  ...                                yes        Not placed
..       ...    ...  ...                                ...               ...
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[117 rows x 9 columns]>

3) adding , deleting , modifying the rows/columns in a dataframe

a)adding a column

In [ ]:
host_day = pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [ ]:
df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

b) deleting a column

In [ ]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

c) adding a row

In [ ]:
df1 = pd.DataFrame({"Rollno":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_peecentage":[99],"B.Tech_percentage":[75],
                    "Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],
                    "placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     118      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [ ]:
df = df.append(df1)
df

     Roll No Gender  ... hostler/day's scholar  placement_status
0        1.0      M  ...                   NaN               NaN
1        2.0      F  ...                   NaN               NaN
2        3.0      F  ...                   NaN               NaN
3        4.0      M  ...                   NaN               NaN
4        5.0      M  ...                   NaN               NaN
..       ...    ...  ...                   ...               ...
113    114.0      M  ...                   NaN               NaN
114    115.0      M  ...                   NaN               NaN
115    116.0      M  ...                   NaN               NaN
116    117.0      M  ...                   NaN               NaN
0        NaN      F  ...               hostler        Not placed

[118 rows x 14 columns]

d) deleting a row

In [ ]:
df=df.drop(3)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

e)modifying elements

In [ ]:
df.loc[1,"hostlers/days scholar"] = "hostler"
df.head()

   Roll No Gender Section  ...  hostler/day's scholar  placement_status  Urban/Rural
0      1.0      M       A  ...                    NaN               NaN        Urban
1      2.0      F       A  ...                    NaN               NaN        Rural
2      3.0      F       A  ...                    NaN               NaN        Urban
3      5.0      M       A  ...                    NaN               NaN        Urban
4      6.0      M       A  ...                    NaN               NaN        Rural

[5 rows x 15 columns]

4) Applying functions on a dataframe

In [ ]:
def gracep(x):
  if (x<70):
     return (x+0.05)
  else:
     return (x)
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(gracep)
df.head()

   Roll No Gender Section  ...  hostler/day's scholar  placement_status  Urban/Rural
0      1.0      M       A  ...                    NaN               NaN        Urban
1      2.0      F       A  ...                    NaN               NaN        Rural
2      3.0      F       A  ...                    NaN               NaN        Urban
3      5.0      M       A  ...                    NaN               NaN        Urban
4      6.0      M       A  ...                    NaN               NaN        Rural

[5 rows x 15 columns]

5)iteration on a dataframe

In [ ]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
   print(rows["Roll No"]),"-",(rows["B.Tech_percentage"])

18.0
60.0
71.0
97.0
102.0

6) accessing elements into a data frame

In [ ]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

7) different ways to deal with NA'S in dataframe

In [ ]:
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  hostler/day's scholar  placement_status  Urban/Rural
0      1.0      M       A  ...                    NaN               NaN        Urban
1      2.0      F       A  ...                    NaN               NaN        Rural
2      3.0      F       A  ...                    NaN               NaN        Urban
3      5.0      M       A  ...                    NaN               NaN        Urban
4      6.0      M       A  ...                    NaN               NaN        Rural

[5 rows x 15 columns]

8) Groupby operations on dataframe

In [ ]:
group = df.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.292400
M    57.343881
Name: B.Tech_percentage, dtype: float64

9) Merging the dataframes

In [ ]:
df2 = pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [ ]:
df = pd.merge(df,df2,on = "Roll No")
df.head()

   Roll No Gender Section  ...  hostler/day's scholar  placement_status  Urban/Rural
0      1.0      M       A  ...                    NaN               NaN        Urban
1      2.0      F       A  ...                    NaN               NaN        Rural
2      3.0      F       A  ...                    NaN               NaN        Urban
3      5.0      M       A  ...                    NaN               NaN        Urban
4      6.0      M       A  ...                    NaN               NaN        Rural

[5 rows x 15 columns]